app/controllers/movies_controller.rb

  def index
	@all_ratings = Movie.pluck(:rating).uniq
	@selected_ratings = []
	flash.keep

	unless params[:ratings].nil?
		session[:ratings] = params[:ratings]
		keys = params[:ratings].keys
		keys.each do |element|
			@selected_ratings << element.to_s
		end
	else
		if session[:ratings].nil?
			@all_ratings.each do |specific_rating|
---
SELECT "movies"."rating" FROM "movies"
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G')